program magicevo;
{$mode objfpc}{$h+}{$j-}

uses
  sysutils,
  sdl2,
  sdl2_image,
  sdl2_mixer,
  engine;

var
  AEngine: TEngine;


begin

  {---------------------------------------------------------------------------}
  { Init SDL                                                                  }
  {---------------------------------------------------------------------------}
  WriteLn('INIT SDL2');
  if SDL_Init(SDL_INIT_VIDEO or SDL_INIT_AUDIO) < 0 then
  begin
    WriteLn('ERROR::MAIN::Failed to Init SDL2');
    Exit;
  end;



  {---------------------------------------------------------------------------}
  { Engin 초기화                                                              }
  {---------------------------------------------------------------------------}
  AEngine := TEngine.Create;

  {---------------------------------------------------------------------------}
  { 이벤트 루프 +  화면 출력                                                  }
  {---------------------------------------------------------------------------}
  AEngine.GameLoop;

  {---------------------------------------------------------------------------}
  { Shutting down video / audio subsystem                                     }
  {---------------------------------------------------------------------------}

  FreeAndNil(AEngine);

  SDL_Quit;
end.
